Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །སེམས་ཞི་སྙིང་རྗེ་བྱམས་པའི་སྤྱན་མངའ་བ།
en: Who have peaceful minds and compassionate, loving eyes.

source: །འཇིག་རྟེན་ཀུན་གྱི་སྐྱབས་དང་དཔུང་གཉེན་མཐོང་།
en: You are the refuge and protection for all beings.

source: །འཇིག་རྟེན་ཀུན་ཏུ་ཆོས་ཀྱི་ཆར་འབེབས་འགྱུར།
en: Send down your rain of Dharma upon the world. {30}

source: །གཞོན་ནུ་ཁྱེའུ་མཆོག་གཉིས་པོ་བྱུང་བ་ཡང་། །གཞན་ཡིན་སྙམ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Do not think that those two young men, Those perfect sons, were anyone else:

source: །མར་མེ་མཛད་ནི་དེ་ན་གཅིག་ཏུ་གྱུར།
en: Dīpaṃkara was at that time one of them,

source: །དེ་ཚེ་ཆོས་སྨྲ་གཉིས་པ་ང་ཡིན་ནོ།
en: And I was the second dharmabhāṇaka. {30a} “At that time Maitreya was the king

source: །གང་གིས་རྗེས་སུ་འཐུན་པའི་ཆོས་ཐོས་པ། །རྒྱལ་པོ་དེར་ཡང་བྱམས་པ་དེ་ཚེ་གྱུར། །ལྷ་མོ་ཕན་འདོད་མཁས་པ་གང་བྱུང་བ།
en: Who listened favorably to the Dharma.

source: །གཞོན་ནུ་ཁྱོད་ནི་དེ་ཚེ་དེར་གྱུར་ཏོ།
en: And you, young man, at that time, Were the wise goddess who wished to help. {30b} “At that time, Devadatta

source: །རྒྱལ་པོ་དེ་ཡི་ནུ་བོ་གང་བྱུང་བ།
en: Was the king’s brother, Influenced by the acquisitive bhikṣus

source: །དགེ་སློང་ཆོས་སྨྲ་འདི་གཉིས་སོད་ཅིག་ཅེས། །དགེ་སློང་རྙེད་པ་འདོད་པས་རྦད་པ་ནི། །ལྷ་སྦྱིན་དེ་ཡི་ཚེ་ན་དེར་གྱུར་ཏོ།
en: Who said, ‘Kill those two dharmabhāṇakas.’ ” {30c}

source: །སྔོན་བྱུང་བའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་གཅིག་པའོ།། །།
en: Conclusion of the twenty-first chapter, “The Past.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ལུས་དང་སྲོག་ལ་མ་ཆགས་པར་བྱའོ།
en: The Teaching on the Body Chapter 22 Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should have no attachment to their life or body.

source: གཞོན་ནུ་ལུས་དང་སྲོག་ལ་ཆགས་པའི་ཕྱིར་སེམས་ཅན་རྣམས་མི་དགེ་བའི་ལས་མངོན་པར་འདུ་བྱེད་པར་འགྱུར་རོ།
en: Because, young man, beings accomplish bad actions due to attachment to their lives and bodies.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུས་དང་སྲོག་ལ་མ་ཆགས་པ་རྣམས་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་རྙེད་པར་མི་དཀའ་ན་ཏིང་ངེ་འཛིན་འདི་ལྟ་ཅི་སྨོས།
en: “Young man, bodhisattva mahāsattvas who have no attachment to their life and body will not even find it difficult to attain the highest, complete enlightenment of perfect buddhahood, not to mention this samādhi.

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་ལུས་དང་སྲོག་ལ་ཡང་མ་ཆགས་པར་བྱའོ།
en: Therefore, young man, have no attachment to your life and body.

source: །ཞེས་དེ་ལྟར་ཁྱོད་ཀྱིས་བསླབ་པར་བྱའོ།
en: That is how you should practice.”

source: རྟག་ཏུ་ཁོར་མོར་རྣག་གི་ལུས་འདི་ལ།
en: “Foolish beings always unceasingly

source: །བྱིས་པ་རྣམས་ནི་རབ་ཏུ་ཆགས་བྱེད་དེ།
en: Have strong attachment to the putrid body.

source: །སྲོག་ལ་འཇུ་ཞིང་བདེ་བ་འདོད་པའི་ཕྱིར།
en: Grasping at life, and for the sake of happiness,

source: །མི་མཁས་པ་དག་རྟག་ཏུ་སྡིག་པ་བྱེད།
en: The unwise always commit bad actions. {i} Those who do not know attachment

source: །སུ་དག་སྙིང་པོ་མེད་པའི་ལུས་སྲོག་ལ། །ལྷག་པར་ཆགས་པ་ཡོད་པ་མ་ཡིན་པ།
en: To body and life, which have no essence,

source: །དེ་དག་གིས་ནི་བདུད་ཀྱི་སྡེ་བཅོམ་སྟེ།
en: Will defeat the armies of Māra

source: །བྱང་ཆུབ་ཤིང་དྲུང་བྱང་ཆུབ་རབ་ཏུ་རྟོགས།
en: And realize enlightenment at the foot of the Bodhi tree. {ii} Those who have attachment to these two things—

source: །སུ་དག་བདག་མེད་སྟོང་པའི་ལུས་རྣམས་དང་། །སྲོག་ཀྱང་རྨི་ལམ་གཡོ་བ་ཟིལ་པ་འདྲ།
en: The body that is empty and selfless, And life, which is like a dream or a fleeting dewdrop—

source: །འདི་གཉིས་ལ་ནི་ཆགས་པར་བྱེད་འགྱུར་བ། །དེ་དག་ཤི་འཕོས་སེམས་ཅན་དམྱལ་བར་འགྲོ།
en: Those people will go to hell when they die. {iii}

source: །ལུས་ངེས་པར་བསྟན་པའི་ལེའུ་སྟེ་ཉི་ཤུ་གཉིས་པའོ།། །།
en: Conclusion of the twenty-second chapter, “The Teaching on the Body.” The Teaching on the Tathāgata’s Body Chapter 23

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་དེ་བཞིན་གཤེགས་པ་ནི་གཟུགས་ཀྱི་སྐུར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should not know the Tathāgata to be the rūpakāya. Why is that?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བ་ཡིན་ཏེ། གཟུགས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་ནོ།
en: It is because the Buddha Bhagavān manifests because of the dharmakāya and does not manifest because of the rūpakāya.

source: །གཞོན་ནུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་སྨོན་པར་འདོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་ཤེས་པར་འདོད་པས་ཏིང་ངེ་འཛིན་འདི་གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ།
en: “Young man, bodhisattva mahāsattvas whose wish is to aspire to the body of the tathāgata, who wish to know the body of the tathāgata, should obtain this samādhi, understand it, preserve it, recite it to others, promote it, proclaim it, chant it, meditate on it with dedication to the practice of meditation, and make it widely known to others.

source: ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། བསྒོམ་པར་བྱ་བསྒོམ་པའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་བྱ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱའོ། །གཞོན་ནུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་བསོད་ནམས་བརྒྱ་པ་ལས་སྐྱེས་པའི་བློ་དང་དོན་གཅིག་ཏུ་བསྟན་པ་ཡིན་ཏེ།
en: “Young man, the body of the tathāgata is taught to be one meaning, with the understanding that it arises from a hundred merits.

source: ཆོས་ལས་སྐྱེས་པ། མཚན་མ་མེད་པ།
en: It arises from the Dharma. It is without attributes.

source: མཚན་མ་ཐམས་ཅད་དང་བྲལ་བ།
en: It is devoid of all attributes.

source: ཟབ་པ་ཚད་མེད་པ་ཚད་མེད་པའི་ཆོས་མཚན་མ་མེད་པའི་ངོ་བོ་ཉིད་མཚན་མ་ཐམས་ཅད་རྣམ་པར་བཤིག་པ།
en: It is profound. It is immeasurable. It is an immeasurable phenomenon. It has the nature of the absence of attributes. It is free of all attributes. It is unwavering. It has no location.

source: མི་གཡོ་བ་མི་གནས་པ་ཤིན་ཏུ་ནམ་མཁའི་ངོ་བོ་ཉིད།
en: It completely has the nature of space. It is invisible.

source: མི་སྣང་བ་མིག་གི་ལམ་ལས་ཡང་དག་པར་འདས་པ་ནི་ཆོས་ཀྱི་སྐུར་རབ་ཏུ་ཤེས་པར་བྱ་སྟེ།
en: It transcends the scope of the eye’s vision. That should be known as the dharmakāya.

source: བསམ་གྱིས་མི་ཁྱབ་པ།
en: “It is inconceivable.

source: བསམ་པའི་ས་དང་བྲལ་བ།
en: It is beyond the level of thought.

source: བདེ་བ་དང་སྡུག་བསྔལ་གྱིས་མི་སྐྱོད་པ།
en: It is unaffected by bliss or suffering.

source: སྤྲོས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ། གནས་མེད་པ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་སྨོན་པར་འདོད་པ་རྣམས་ཀྱི་སྒྲ་ལས་ཤིན་ཏུ་འདས་པའི་སྙིང་པོ་སྟེ་འདོད་ཆགས་ལས་ཡང་དག་པར་འདས་པ།
en: It transcends all conceptual elaboration. It has no location, because it transcends the scope of the words of those who aspire to the wisdom of buddhahood. It is the quintessence because it transcends desire.

source: དབྱེར་མི་ཕྱེད་པ་སྟེ་ཞེ་སྡང་ལས་ཡང་དག་པར་འདས་པ་བརྟན་པ་སྟེ།
en: It is indivisible because it transcends anger. It is stable because it transcends the scope of ignorance. It is taught through the teaching of emptiness.

source: གཏི་མུག་ལས་ཡང་དག་པར་འདས་པ་སྟོང་པ་ཉིད་དུ་བསྟན་པས་ངེས་པར་བསྟན་པ་མ་སྐྱེས་པ་སྐྱེ་བ་ལས་ཡང་དག་པར་འདས་པ། ཐ་སྙད་དུ་བརྟགས་པ། མྱ་ངན་ལས་འདས་པ་བྱེ་བྲག་མེད་པ། སྒྲས་མྱ་ངན་ལས་འདས་པ་དབྱངས་ཀྱིས་ཞི་བ།
en: It is unborn because it transcends birth. It is ‘permanent’ in terms of words, and terminology is empty. It is undifferentiated because it is nirvāṇa. It is ‘nirvāṇa’ because of a word.

source: བརྡས་མཚུངས་པར་གྱུར་པ། དོན་དམ་པས་བརྡར་གྱུར་པ།
en: It is ‘peace’ because of speaking. There is equality in terms of conventional appellations. There are appellations in terms of ultimate truth.

source: ཡང་དག་པ་ཇི་ལྟ་བའི་ཚིག་གིས་དོན་དམ་པ།
en: There is ultimate truth through correct speech.

source: ཡོངས་སུ་གདུང་བ་མེད་པས་བསིལ་བ། གནས་མེད་པ། གཞལ་དུ་མེད་པ། ཁ་དོག་བསྟན་པས་མུ་མེད་པ།
en: “It is calmness, the absence of anguish. It is groundless, and cannot be comprehended. There is no end to its description.

source: མངོན་པར་ཤེས་པ་ཆེན་པོ་ཡོངས་སུ་སྦྱང་བ་ལས་བྱུང་བ་སྟེ། གཞོན་ནུ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཞེས་བྱའོ།
en: “Young man, it arises from training in the great, higher cognitions, and it is known as the tathāgatakāya.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །འདི་འདྲའི་འཇིག་རྟེན་མགོན་པོའི་སྐུ། །སུ་དག་ཤེས་པར་འདོད་པ་ནི།
en: Thereupon, the Bhagavān spoke these verses: “Someone who wishes to know This body of the Lord of the World

source: །ཏིང་འཛིན་འདི་ནི་སྒོམ་གྱིས་དང་། །སངས་རྒྱས་སྐུ་ནི་ཤེས་པར་འགྱུར།
en: Should meditate on this samādhi, And then they will know the Buddha’s body. {1}

source: །སངས་རྒྱས་སྐུ་ནི་དག་པ་སྟེ། །བསོད་ནམས་བརྒྱ་སྐྱེས་འོད་ཀྱང་གསལ།
en: “A buddha’s body is born from merit. It is pure and it is brilliant.

source: །དེ་ནི་བར་སྣང་མཚུངས་པ་སྟེ། །དེ་ལ་ཐ་དད་བྱ་བ་མེད།
en: It is the same as space; There is no difference between them. {2} “The characteristics of a buddha

source: །སངས་རྒྱས་བྱང་ཆུབ་ཅི་འདྲ་བ།
en: Are the same as those of enlightenment. The characteristics of the body

source: །མཚན་རྣམས་ཀྱང་ནི་དེ་འདྲ་སྟེ། །དེ་ཡི་མཚན་རྣམས་ཅི་འདྲ་བ། །དེ་ཡི་སྐུ་ཡང་དེ་འདྲའོ།
en: Are the same as those characteristics. {3}

source: །སྐུ་ནི་བྱང་ཆུབ་མཚན་ཉིད་དེ།
en: “The body has enlightenment’s characteristics

source: །སངས་རྒྱས་ཞིང་ཡང་དེ་འདྲ་ཞིང་།
en: And a buddha realm has the same.

source: །སྟོབས་དང་རྣམ་ཐར་བསམ་གཏན་ཡང་།
en: The strengths, liberations, and dhyānas

source: །དེ་དག་ཐམས་ཅད་མཚན་ཉིད་གཅིག །
en: Are all also a single characteristic. {4} “That is the nature of the emergence

source: དེ་ལྟར་སངས་རྒྱས་འབྱུང་འགྱུར་ཏེ། །འཇིག་རྟེན་མགོན་པོའི་དེ་འདྲ་བས།
en: Of the buddhas, of the lords of worlds.

source: །སུས་ཀྱང་ཤ་ཡི་མིག་གིས་ནི།
en: There is no being who with physical eyes

source: །ནམ་ཡང་མཐོང་བར་མི་ནུས་སོ།
en: Is able to see their bodies. {5}

source: །མང་པོ་དག་ཀྱང་འདི་སྐད་སྨྲ།
en: “There are many who declare,

source: །ངས་ནི་འཇིག་རྟེན་འདྲེན་པ་མཐོང་།
en: ‘I have seen the guide of the world.

source: །སྐུ་ཡང་གསེར་གྱི་ཁ་དོག་ལ། །འཇིག་རྟེན་ཐམས་ཅད་སྣང་བར་མཛད།
en: He is the color of gold and his body Illuminates the entire world.’ {6} “This body that is seen, Beautified by characteristics, Is a manifestation through the power

source: །སངས་རྒྱས་དག་གི་བྱིན་རླབས་དང་། །མཐུ་དང་རྣམ་པར་སྤྲུལ་པ་ཡིས། །དེ་ལྟར་མཚན་གྱིས་སྤྲས་པ་ཡི།
en: Of the blessing of the buddhas. {7}

source: །སྐུ་དག་ཤིན་ཏུ་སྣང་བ་ཡིན། །བོངས་ཚོད་ཁྲུན་དང་སྦོམས་སུ་ཡང་། །སངས་རྒྱས་སྐུ་ནི་བཤད་མོད་ཀྱིས།
en: “The Buddha’s body is displayed

source: །སྐུ་ཡི་ཚད་ནི་མ་རྙེད་དེ།
en: As having a height and a width, But that body cannot be measured,

source: །དེ་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: And therefore it is inconceivable. {8}

source: །སངས་རྒྱས་སྐུ་ནི་འདི་ཙམ་ཞེས།
en: “If the Buddha’s body could be measured

source: །གལ་ཏེ་ཚད་ཀྱང་རྙེད་གྱུར་ན།
en: And found to be of a certain size, Then the Teacher would be the same

source: །ལྷ་དག་དང་ནི་མི་རྣམས་དང་། །སྟོན་པ་བྱེ་བྲག་མེད་པར་འགྱུར།
en: As a deva or a human. {9}

source: །མཉམ་པར་གཞག་པའི་སེམས་ཀྱི་ནི། །རྣམ་པར་སྨིན་པའང་དེ་ཡི་མཚན།
en: “That characteristic is the ripening Of a mind in meditation.

source: །མིང་དང་གཟུགས་ཀྱང་དེ་འདྲ་མཚན། །རྣམ་པར་དག་ཅིང་འོད་གསལ་འགྱུར།
en: There will be pure, radiant names-and-form That have that characteristic. {10} “There is no being whatsoever

source: །ཇི་ལྟར་འཇིག་རྟེན་མགོན་པོ་ཡིས།
en: Who has meditated on this samādhi of peace It is in that way that the Lord of the World

source: །བསྐལ་པ་བྱེ་བར་བསྙེན་པ་ལྟར།
en: Has practiced for millions of eons. {11}

source: །སུས་ཀྱང་ཏིང་འཛིན་ཞི་བ་འདི། །ནམ་ཡང་གོམས་པར་མ་བྱས་སོ།
en: “I have developed this samādhi

source: །དཀར་པོའི་ཆོས་ནི་མང་པོ་ཡིས། །ཏིང་འཛིན་འདི་ནི་བསྐྱེད་པ་སྟེ།
en: Through a multitude of good qualities.

source: །ཏིང་འཛིན་འདི་ནི་རྒྱ་ཆེ་བས།
en: Because of the vastness of that samādhi

source: །ང་ཡི་ལུས་ཀྱང་མི་སྣང་ངོ་།
en: My body cannot be seen. {12}

source: །གང་གི་སེམས་ནི་ཅི་འདྲ་བ།
en: “As is someone’s mind,

source: །མིང་དང་གཟུགས་ཀྱང་དེ་འདྲ་སྟེ།
en: So are their names-and-form;

source: །རང་བཞིན་མེད་པའི་སེམས་ཀྱི་ནི།
en: The mind that has no nature of its own

source: །མིང་དང་གཟུགས་ཀྱང་མཚན་དེ་འདྲ།
en: Has names-and-form with that characteristic. {13} “Those who have a gross perception

source: །མིང་དང་གཟུགས་ལ་གང་གི་ནི། །འདུ་ཤེས་རགས་པ་འཇུག་པ་ཡང་།
en: Of names-and-form,

source: །སྐལ་པ་མི་མཉམ་འདུ་ཤེས་ཀྱིས།
en: Their inharmonious perception

source: །རགས་པའི་སེམས་ཀྱང་སྐྱེ་བར་འགྱུར།
en: Gives rise to a mind that is gross. {14} “Those who have a subtle perception

source: །མིང་དང་གཟུགས་ལ་སུ་དག་གི། །འདུ་ཤེས་ཕྲ་མོ་འཇུག་པ་ནི།
en: Within their names-and-form

source: །མིང་དང་གཟུགས་ལ་མ་ཆགས་པས། །སེམས་ནི་རབ་ཏུ་འོད་གསལ་འགྱུར།
en: Will have a mind that is radiant And without attachment to names-and-form. {15}

source: །ངས་དྲན་སྔོན་གྱི་ཚེ་རབས་ནི།
en: “I remember that in my previous lives

source: །གྲངས་མེད་པ་དག་བདུན་དུ་ཡང་།
en: During seven countless eons,

source: །སྡིག་པའི་འདུ་ཤེས་གསུམ་པོ་དག །ནམ་ཡང་སྐྱེས་པར་མ་གྱུར་ཏོ།
en: The three bad perceptions Never arose in me at any time. {16}

source: །ང་ཡི་སེམས་ནི་ཟག་མེད་དེ།
en: “My mind has been undefiled

source: །སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ཀྱང་།
en: I bring benefit to beings

source: །ང་ཡི་ལུས་ནི་མི་སྣང་ངོ་། །ཇི་ལྟར་གང་གི་དངོས་པོ་ལས།
en: And my body is not visible. {17}

source: །ཡིད་ཀྱང་རྣམ་པར་གྲོལ་གྱུར་པ།
en: “The one whose mind Is liberated from existents

source: །དེ་དག་དེ་ཡི་དངོས་པོ་དང་། །ཕྱིར་ཡང་ཕྲད་པར་མི་འགྱུར་རོ།
en: Will never again be

source: །དངོས་པོ་ཀུན་ལས་རྣམ་པ་ཀུན།
en: Connected with existents. {18}

source: །ང་ཡི་རྣམ་ཤེས་རྣམ་གྲོལ་ཏེ།
en: “My consciousness is liberated Completely from all things.

source: །སེམས་ཀྱི་རང་བཞིན་ཤེས་པས་ན།
en: I know the nature of the mind,

source: །ཕྱིར་ཡང་ཡེ་ཤེས་འབྱུང་བར་འགྱུར།
en: So that henceforth wisdom will arise. {19} “My emanations proceed

source: །ཞིང་རྣམས་བྱེ་བ་ཕྲག་སྟོང་དུ། །ང་ཡི་སྤྲུལ་པ་དག་ཀྱང་འགྲོ།
en: To thousands of millions of realms.

source: །སེམས་ཅན་རྣམས་ཀྱི་དོན་ཀྱང་བྱེད།
en: There they benefit beings

source: །དེ་ལ་ལུས་ཀྱང་རྙེད་མི་འགྱུར།
en: Though there is no body to be found. {20}

source: །མཚན་ཉིད་མེད་ཅིང་མཚན་མ་མེད། །ཇི་ལྟར་ནམ་མཁའ་དེ་བཞིན་དུ།
en: “Without characteristics, without attributes, It is the same as space.

source: །ང་ཡི་སྐུ་ཡང་བརྗོད་མེད་ཅིང་།
en: My body is indescribable.

source: །ཤེས་པར་དཀའ་བར་རབ་ཏུ་བསྟན།
en: It is taught to be difficult to understand. {21}

source: །དཔའ་བོ་ཆེན་པོ་ཆོས་ཀྱི་སྐུ།
en: “The dharmakāya, the great hero,

source: །སྐུ་ནི་ཆོས་ལས་སྐྱེས་པ་སྟེ། །གཟུགས་ཀྱི་སྐུར་ནི་ནམ་དུ་ཡང་།
en: Is a body born from the Dharma.

source: །རྒྱལ་བ་གདགས་པར་ཡོང་མི་ནུས།
en: The Jina cannot be made known By means of the rūpakāya. {22} “Māra will find no opportunity

source: །ཇི་ལྟར་བཤད་པ་འདི་དག་ཀྱང་།
en: To cause harm to the one

source: །ཐོས་ནས་དགའ་བར་འགྱུར་བ་ནི། །དེ་ལ་སྡིག་ཅན་བདུད་ཀྱིས་ཀྱང་།
en: Who has felt joy on hearing

source: །ཀླན་ཀ་རྙེད་པར་མི་འགྱུར་རོ།
en: These words that have been taught. {23}

source: །ཟབ་མོ་ཡི་ནི་ཆོས་ཐོས་ནས།
en: “Those who have heard the profound Dharma

source: །དེ་ལ་སྐྲག་པ་མི་འབྱུང་སྟེ།
en: And have not been frightened by it,

source: །དེ་ནི་སྲོག་གི་ཕྱིར་དུ་ཡང་།
en: Will not even for the sake of their lives

source: །སངས་རྒྱས་བྱང་ཆུབ་སྤོང་མི་བྱེད།
en: Forsake the enlightenment of buddhahood. {24} “They will know the truth that is taught

source: །མདོ་སྡེ་བྱེ་བ་ཕྲག་སྟོང་གི།
en: In thousands of millions of sūtras.

source: །ཡང་དག་བསྟན་པ་ཤེས་པར་འགྱུར།
en: They will be a light for the world

source: །གང་དང་གང་དུ་སོང་བར་ཡང་། །འཇིག་རྟེན་དག་ལ་སྣང་བར་འགྱུར།
en: Wherever it is that they will go. {25}

source: །གཞོན་ནུ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་མཚན་མ་དང་ལས་ཀྱིས་ཀྱང་ཤེས་པར་སླ་བ་མ་ཡིན་ཏེ།
en: “Young man, the body of the Tathāgata is not easily known through attributes or actions.

source: སྔོན་པོའམ་ཁ་དོག་སྔོན་པོའམ། སྔོན་པོ་ལྟ་བུར་སྟོན་པའམ། འོད་སྔོན་པོ་འབྱུང་བའམ།
en: It is blue, or is colored blue, or is like blue, or shines with blue light;

source: སེར་པོའམ། ཁ་དོག་སེར་པོའམ། སེར་པོ་ལྟ་བུར་སྟོན་པའམ། འོད་སེར་པོ་འབྱུང་བའམ།
en: or it is yellow, or is colored yellow, or is like yellow, or shines with yellow light;

source: དམར་པོའམ། ཁ་དོག་དམར་པོའམ། དམར་པོ་ལྟ་བུར་སྟོན་པའམ། འོད་དམར་པོ་འབྱུང་བའམ། དཀར་པོའམ།
en: or it is red, or is colored red, or is like red, or shines with red light;

source: ཁ་དོག་དཀར་པོའམ། དཀར་པོ་ལྟ་བུར་སྟོན་པའམ། འོད་དཀར་པོ་འབྱུང་བའམ། ལེ་བརྒན་ནམ།
en: or it is white, or is colored white, or is like white, or shines with white light;

source: ཁ་དོག་ལེ་བརྒན་ནམ། ལེ་བརྒན་ལྟ་བུར་སྟོན་པའམ། འོད་ལེ་བརྒན་འབྱུང་བའམ། ཤེལ་ལམ།
en: or it is madder, or is colored madder, or is like madder, or shines with madder light;

source: ཤེལ་གྱི་ཁ་དོག་གམ། ཤེལ་ལྟ་བུར་སྟོན་པའམ། ཤེལ་གྱི་འོད་འབྱུང་བའམ།
en: or it is crystal, or is crystal-colored, or is like crystal, or shines with crystal light;

source: མེའམ། མེའི་ཁ་དོག་གམ། མེ་ལྟ་བུར་སྟོན་པའམ། མེའི་འོད་འབྱུང་བའམ། མར་གྱི་སྙིང་པོའམ།
en: or it is fire, or is fire-colored, or is like fire, or shines with fire light;

source: མར་གྱི་ཁ་དོག་གམ། མར་ལྟ་བུར་སྟོན་པའམ། མར་གྱི་འོད་འབྱུང་བའམ།
en: or it is distilled ghee, or is ghee-colored, or is like ghee, or shines with ghee-colored light;

source: གསེར་རམ། གསེར་གྱི་ཁ་དོག་གམ། གསེར་ལྟ་བུར་སྟོན་པའམ། གསེར་གྱི་འོད་འབྱུང་བའམ། བཻ་དཱུརྱའམ།
en: or it is gold, or is gold-colored, or is like gold, or shines with golden light;

source: བཻ་དཱུརྱའི་ཁ་དོག་གམ། བཻ་དཱུརྱ་ལྟ་བུར་སྟོན་པའམ། བཻ་དཱུརྱའི་འོད་འབྱུང་བའམ།
en: or it is beryl, or is beryl-colored, or is like beryl, or shines with beryl light;

source: གློག་གམ། གློག་གི་ཁ་དོག་གམ། གློག་ལྟ་བུར་སྟོན་པའམ།
en: or it is lightning, or is lightning-colored, or is like lightning, or shines with lightning’s light;

source: གློག་གི་འོད་འབྱུང་བའམ། ཚངས་པའམ། ཚངས་པའི་ཁ་དོག་གམ། ཚངས་པ་ལྟ་བུར་སྟོན་པའམ། ཚངས་པའི་འོད་འབྱུང་བའམ།
en: or it is Brahmā, or is Brahmā-colored, or is like Brahmā, or shines with Brahmā’s light;

source: ལྷའམ། ལྷའི་ཁ་དོག་གམ། ལྷ་ལྟ་བུར་སྟོན་པའམ། ལྷའི་འོད་འབྱུང་བའོ།
en: or it is a deva, or is deva-colored, or is like a deva, or shines with a deva’s light.

source: །ཞེས་ཤེས་པར་སླ་བ་མ་ཡིན་ནོ།
en: It is not easy to know it.

source: །གཞོན་ནུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་དག་པ་སྟེ།
en: “Young man, in that way the body of the tathāgata is pure.

source: མཚན་མ་དག་གིས་བསམ་པར་བྱ་བ་མ་ཡིན་པ།
en: It cannot be conceived of through attributes, and so it is taught to be inconceivable.

source: བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པ། མཚན་མ་ཐམས་ཅད་ཀྱིས་ཀྱང་བསྟན་པར་བྱ་བ་མ་ཡིན་པ།
en: It cannot be conceived of through any attribute, and so it is taught to be inconceivable.

source: བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པ་སྟེ།
en: It cannot be conceived of through external appearances.

source: རྣམ་པ་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་ཅིང་དཔག་ཏུ་མེད་པ་ཞེས་བྱ་བ་མ་གཏོགས་པར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཀྱང་གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་རྫོགས་པས་སྐུའི་ཚད་གཟུང་བར་སླ་བ་མ་ཡིན་ནོ།
en: It is immeasurable. The beings and devas of this world cannot easily grasp its extent even through the perfect rūpakāya.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: The Bhagavān then spoke these verses:

source: །འཇིག་རྟེན་ཁམས་ཀྱི་རྡུལ་ཕྲན་དང་། །རྡུལ་དུ་མིང་ཡང་སྟོན་པ་དང་། །མཚེའུ་དང་རྫིང་དང་ལྟིང་ཀ་དང་། །རྒྱ་མཚོ་ན་ཡང་ཇི་སྙེད་ཆུ།
en: “All the particles in the world And all that can be conceived of as dust, And all the water that is in springs, Lakes, ponds, and the ocean— {26}

source: །འདི་སྙེད་རྡུལ་ཕྲན་ཡོད་དོ་ཞེས།
en: “One may ask how many particles there are,

source: །དེ་དག་ལ་ནི་མཐའ་མི་རྙེད། །རྒྱ་མཚོ་ལ་ནི་སྐྲ་རྩེ་ཡིས།
en: But one can never find the end. Even if, with the tip of a hair, one could measure out How much water there is in an ocean, {26–27}

source: །ཆུ་ཐིགས་གཞལ་བར་ནུས་ཀྱང་ནི།
en: “Even that could not be taught

source: །འཇིག་རྟེན་མགོན་པོའི་དཔེ་ཉིད་དུ། །ཡང་དག་བསྟན་པར་མི་རུང་ངོ་།
en: As an analogy for the Lord of the World.

source: །ཆུ་ཡི་ཐིགས་པ་དཔག་མེད་ཅིང་།
en: There are countless drops of water

source: །དེ་བཞིན་རབ་ཏུ་ཕྲ་བའི་རྡུལ།
en: And it is the same for atoms, {27}

source: །དེ་བས་སེམས་ཅན་གཅིག་གི་ཡང་།
en: “But I see that even a single sentient being

source: །ཤིན་ཏུ་མང་དུ་ངས་མཐོང་སྟེ།
en: Has far more numerous

source: །མོས་པ་དང་ནི་སེམས་བསྐྱེད་པ།
en: Aspirations and motivations

source: །དུ་མ་དག་ནི་ཤེས་མི་སླ། །ངས་ནི་སྐུ་ཡི་ཡོན་ཏན་དག །ཡང་དག་པ་ནི་གང་བསྟན་པ།
en: That are developed at numerous times. {28}

source: །སེམས་ཅན་ཀུན་གྱི་མོས་པ་ཡང་།
en: “Yet even the aspirations of all beings

source: །དེ་དག་དཔེ་རུ་བཟོད་མི་འགྱུར།
en: Are not adequate as an analogy For those qualities of the body That I have indicated. {29}

source: །མཚན་མ་དང་ནི་ལས་རྣམས་དང་། །ཁ་དོག་སྣང་བ་འདི་འདྲ་ཞེས།
en: “One cannot through attributes and actions Know the appearance of these kinds

source: །སངས་རྒྱས་ཀྱི་ནི་ཤེས་མི་ནུས།
en: Of qualities of a buddha,

source: །ང་ཡི་བྱེ་བྲག་དེ་འདྲའོ།
en: And that is my distinctive characteristic. {30}

source: །སངས་རྒྱས་མཚན་མ་བྲལ་བ་སྟེ།
en: “The buddhas are devoid of attributes.

source: །ཆོས་ཀྱི་སྐུ་ཡིས་རབ་ཏུ་ཕྱེ།
en: They are the manifestation of the dharmakāya.

source: །ཟབ་ཅིང་དཔག་ཏུ་མེད་པ་སྟེ།
en: They are profound and immeasurable,

source: །དེ་ཕྱིར་སངས་རྒྱས་བསམ་མི་ཁྱབ།
en: And therefore the buddhas are inconceivable. {31}

source: །སངས་རྒྱས་བསམ་དུ་མེད་པ་ཡི།
en: “The inconceivable buddha body

source: །སངས་རྒྱས་སྐུ་ཡང་བསམ་དུ་མེད།
en: Of a buddha is also inconceivable.

source: །སྐུ་དེ་བསམ་དུ་མེད་པ་ཡི།
en: Those bodies are inconceivable.

source: །སངས་རྒྱས་སྐུ་ནི་སེམས་ཀྱིས་ཀྱང་།
en: The bodies of the buddhas.

source: །བསམ་པར་བཟོད་པ་མ་ཡིན་ཏེ།
en: One cannot, therefore, obtain

source: །དེ་ལྟར་དེ་ཡི་སྐུ་ལ་ཡང་། །ཚད་ཀྱང་ཉེ་བར་མི་དམིགས་སོ།
en: The measure of such a body. {33}

source: །ཆོས་རྣམས་དེ་དག་དཔག་ཏུ་མེད།
en: “Those immeasurable qualities

source: །བསྐལ་པ་བྱེ་བར་བསྙེན་པས་ན།
en: I have practiced for ten million eons.

source: །དེ་ཕྱིར་ང་ཡི་ལུས་ཀྱང་ནི། །འོད་གསལ་བསམ་དུ་མེད་པ་གྲུབ།
en: Therefore have I accomplished A body that is inconceivable and radiant, too. {34}

source: །སེམས་ཅན་ཀུན་གྱིས་གཟུང་དུ་མེད།
en: “There is no being that can grasp it

source: །ཚད་ཀྱིས་གཟུང་བྱ་མ་ཡིན་ཏེ།
en: Or that can obtain its measure.

source: །དེ་ལྟ་སངས་རྒྱས་སྐུ་དག་ནི།
en: In that way the body of a buddha

source: །ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པ།
en: Is inconceivable and immeasurable. {35}

source: །ཚད་མེད་པ་ཡི་ཆོས་དག་གིས།
en: “Because the qualities are immeasurable

source: །དེ་ལ་ཚད་ནི་བརྟག་ཏུ་མེད།
en: There is no measure that can be conceived for them.

source: །མ་བརྟགས་པ་ཡི་ཆོས་དག་གིས།
en: Because the qualities are not conceived

source: །དེ་ལྟར་སངས་རྒྱས་མ་བརྟགས་སོ།
en: The buddha also is inconceivable. {36}

source: །རྟོག་པ་དག་ནི་ཚད་དུ་བསྟན།
en: “The measured is taught to be a conception;

source: །རྟོག་པ་མེད་པ་ཚད་མེད་ཡིན།
en: The measureless is nonconceptual.

source: །མི་རྟོག་རྟོག་དང་བྲལ་བས་ན།
en: That which is not conceived is without conception;

source: །དེ་ཕྱིར་སངས་རྒྱས་བསམ་དུ་མེད།
en: Therefore the buddha is inconceivable. {37}

source: །ཇི་ལྟར་ནམ་མཁའ་ཚད་མེད་ལ།
en: “Just as space is limitless

source: །སུས་ཀྱང་གཞལ་དུ་མི་ནུས་པ།
en: And no one is able to measure it,

source: །དེ་བཞིན་སངས་རྒྱས་སྐུ་དག་ཀྱང་།
en: Likewise a buddha’s body

source: །ནམ་མཁའ་ཉིད་དང་འདྲ་ཞིང་མཚུངས།
en: Is just the same as space. {38} “Those who thus know the body

source: །སངས་རྒྱས་སྐུ་ནི་དེ་ལྟ་བུར།
en: Of the buddhas are the progeny of the jinas.

source: །གང་གིས་རིག་པ་རྒྱལ་བའི་སྲས།
en: They will also become buddhas,

source: །དེ་དག་བསམ་གྱིས་མི་ཁྱབ་པ། །སངས་རྒྱས་འཇིག་རྟེན་མགོན་པོར་འགྱུར།
en: Inconceivable lords of worlds.” {39}

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ངེས་པར་བསྟན་པའི་ལེའུ་སྟེ་ཉི་ཤུ་གསུམ་པའོ།། །།
en: Conclusion of the twenty-third chapter, “The Teaching on the Tathāgata’s Body.” The Inconceivable Tathāgata Chapter 24
